Tekla Open API Reference for Tekla Structures 2025
InvalidAttributesForOperationException Constructor
 Creates a new exception instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public InvalidAttributesForOperationException(
	string Message
)
Public Sub New (
	Message As String
)
Parameters
Message
Type: System.String
The exception message.
See Also
Reference
InvalidAttributesForOperationException Class
Tekla.Structures.Drawing Namespace